_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_СравнениеСмет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_СравнениеСмет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Смета1</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ОбъектнаяСмета</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_СводнаяСмета</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смета2</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ОбъектнаяСмета</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_СводнаяСмета</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фоном</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_АктВыполненныхРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДопЗМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗатратыТрудаМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗатратыТрудаРабочих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимВозвратМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимЗарплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимОборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимОснЗарплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимПрямЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимСтоимМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимОборудЗаказчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимПоПрайсам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Смета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ПозицияЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыСтроительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыСтроительства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НовоеСтроительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДорожноеСтроительство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыЗатратСмета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыЗатратСмета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщестроительныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеталломонтажныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СантехническиеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БуровзрывныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГорнопроходческиеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МебельИнвентарь</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_СравнениеСмет/Ext/ManagerModule.bsl
#Область Сравнение

Процедура СравнитьСметы(ПараметрыВызоваСервера,АдресХранилища) Экспорт
	
	ШаблонСДанными 		= ПараметрыВызоваСервера.ШаблонСДанными;
	ТолькоОтклонения 	= ?(ПараметрыВызоваСервера.Свойство("ТолькоОтклонения"),ПараметрыВызоваСервера.ТолькоОтклонения,Ложь);
	ТолькоРасчет 		= ?(ПараметрыВызоваСервера.Свойство("ТолькоРасчет"),ПараметрыВызоваСервера.ТолькоРасчет,Ложь);
	ПоАкту 				= ПараметрыВызоваСервера.СравнениеПоАкту;

	// Сравнение объектных смет
	Если ТипЗнч(ПараметрыВызоваСервера.СметыСравнения.Смета1) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		
		ДеревоСмета1 = СобратьДанныеПоСмете(ПараметрыВызоваСервера.СметыСравнения.Смета1);
		ДеревоСмета2 = СобратьДанныеПоСмете(ПараметрыВызоваСервера.СметыСравнения.Смета2);
		
		Макет 				= Обработки.СМ_СравнениеСмет.ПолучитьМакет("МакетСравнениеОС");
		ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");

		ШаблонСДанными.Вывести(ОбластьЗаголовок);
		ШаблонСДанными.Вывести(ОбластьШапка);	
		
		ОбщаяТаблицаДанных 	= ПолучитьОбщуюТаблицуДанныхОС(ДеревоСмета1,ДеревоСмета2);
		РеквизитыСравнения 	= ПолучитьСписокРеквизитовСравнения();
		ТипСтроительства	= ПараметрыВызоваСервера.СметыСравнения.Смета1.ТипСтроительства;

		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ЭтоСмета",Истина);
		
		ТаблицаДанных1 	= ДеревоСмета1.Скопировать(СтруктураОтбора); 
		ТаблицаДанных2 	= ДеревоСмета2.Скопировать(СтруктураОтбора);
	
		ПереименуемКолонкиДерева(ТаблицаДанных2);
		ПереименуемКолонкиДерева(ДеревоСмета2);

		ВывестиДанныеПоОС(ШаблонСДанными,РеквизитыСравнения,Макет,ДеревоСмета1,ДеревоСмета2,ОбщаяТаблицаДанных,ТипСтроительства);
		
	// Сравнение сводных смет
	ИначеЕсли ТипЗнч(ПараметрыВызоваСервера.СметыСравнения.Смета1) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
		
		ДеревоСмета1 = СобратьДанныеПоСмете(ПараметрыВызоваСервера.СметыСравнения.Смета1);
		ДеревоСмета2 = СобратьДанныеПоСмете(ПараметрыВызоваСервера.СметыСравнения.Смета2);
		
		Макет 				= Обработки.СМ_СравнениеСмет.ПолучитьМакет("МакетСравнениеСС");
		ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");
		
		ШаблонСДанными.Вывести(ОбластьЗаголовок);
		ШаблонСДанными.Вывести(ОбластьШапка);
		
		СтруктураДанных		= ПолучитьОбщуюТаблицуДанныхСС(ДеревоСмета1,ДеревоСмета2);
		РеквизитыСравнения 	= ПолучитьСписокРеквизитовСравнения();
	
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ЭтоСмета",Истина);
		
		ТаблицаДанных1 = ДеревоСмета1.Скопировать(СтруктураОтбора); 
		ТаблицаДанных2 = ДеревоСмета2.Скопировать(СтруктураОтбора);

		ПереименуемКолонкиДерева(ТаблицаДанных2);
		ПереименуемКолонкиДерева(ДеревоСмета2);
		
		ОбщаяТаблицаДанных	= СтруктураДанных.ТабИтогов;
		ТабГлавы			= СтруктураДанных.ТабГлавы;
		ТипСтроительства	= ПараметрыВызоваСервера.СметыСравнения.Смета1.ТипСтроительства;
		
		ВывестиДанныеПоСС(ШаблонСДанными,РеквизитыСравнения,Макет,ДеревоСмета1,ДеревоСмета2,ОбщаяТаблицаДанных,ТабГлавы,ТипСтроительства);
		
	Иначе
		
		ДеревоСмета1 		= СоздатьДерево();
		ОбластиРаскраски 	= ПолучитьОбластиРаскраски();		
		
		СМ_СметныйСоставВызовСервера.ВывестиОбновитьДерево(ПараметрыВызоваСервера.СметыСравнения.Смета1, ДеревоСмета1);
		Если ТолькоРасчет Тогда
			МассивУдалять = ДеревоСмета1.Строки.НайтиСтроки(Новый Структура("Расчет",Ложь),Истина);
			Для Каждого эл Из МассивУдалять Цикл
				Если эл.Родитель = Неопределено Тогда
					ДеревоСмета1.Строки.Удалить(эл);
				Иначе
					эл.Родитель.Строки.Удалить(эл);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ПроставитьУровень(ДеревоСмета1.Строки,0,Ложь);
		
		Если ПоАкту Тогда
			ДеревоСмета2		= СоздатьДеревоАкта();
			РеквизитыСравнения 	= ПолучитьСписокДляСравненияАкт();
			ТекАкт 				= ПараметрыВызоваСервера.СметыСравнения.Смета2;
			ТекСмета 			= ТекАкт.ЛокальнаяСмета;
			СМ_СметныйСоставВызовСервера.ВывестиОбновитьДерево(ТекСмета,ДеревоСмета2,ТекАкт,Истина);
			ПроставитьУровень(ДеревоСмета2.Строки,0,Истина);
		Иначе
			ДеревоСмета2 		= ДеревоСмета1.Скопировать();
			РеквизитыСравнения 	= ПолучитьСписокДляСравнения();
			СМ_СметныйСоставВызовСервера.ВывестиОбновитьДерево(ПараметрыВызоваСервера.СметыСравнения.Смета2, ДеревоСмета2);
			ПроставитьУровень(ДеревоСмета2.Строки,0,Ложь);
		КонецЕсли;
		
		ПереименуемКолонкиДерева(ДеревоСмета2);
		Если ТолькоРасчет Тогда
			МассивУдалять = ДеревоСмета2.Строки.НайтиСтроки(Новый Структура("Расчет",Ложь),Истина);
			Для Каждого эл Из МассивУдалять Цикл
				Если эл.Родитель = Неопределено Тогда
					ДеревоСмета2.Строки.Удалить(эл);
				Иначе
					эл.Родитель.Строки.Удалить(эл);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ПоАкту Тогда
			ТабСтоимости = ПолучитьЕдиничнуюСтоимостьПозиций(ТекСмета,ТекАкт);
			ПересчетДереваПоАктуДанныеРегистра(ДеревоСмета1,ТабСтоимости);
		КонецЕсли;
		
		Макет = Обработки.СМ_СравнениеСмет.ПолучитьМакет("Макет");
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ШаблонСДанными.Вывести(ОбластьЗаголовок);
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ШаблонСДанными.Вывести(ОбластьШапка);	
		
		ОбластьРаздел 	= Макет.ПолучитьОбласть("ОбластьРаздел");
		ОбластьПозиция 	= Макет.ПолучитьОбласть("ОбластьПозиция");
		
		Корень = ДеревоСмета1.Строки[0];
		ОбластьРаздел.Параметры.Заполнить(Корень);
		Корень.Обработано = Истина;
		
		Корень1 = ДеревоСмета2.Строки[0];
		ОбластьРаздел.Параметры.Заполнить(Корень1);
		Корень1.Обработано1 = Истина;        
		
		ТекстОтбора = СформироватьОтборРасценок(ПараметрыВызоваСервера.ПоляПозиции);
		
		ШаблонСДанными.НачатьАвтогруппировкуСтрок();
		ШаблонСДанными.Вывести(ОбластьРаздел,0);
		
		ВывестиУровень(ШаблонСДанными,РеквизитыСравнения,ОбластиРаскраски,Макет,Корень.Строки,Корень1.Строки,Корень1,ТекстОтбора,1,,ТолькоОтклонения);
		
		МассивСтрок = Корень1.Строки.НайтиСтроки(Новый Структура("Обработано1",Ложь),Истина);
		ВывестиНеОбработанные(ШаблонСДанными,Макет,МассивСтрок,1);
		
		ШаблонСДанными.ЗакончитьАвтогруппировкуСтрок();
		
		//Структура 		= Новый Структура("ШаблонСДанными",ШаблонСДанными);
		//АдресХранилища	= ПоместитьВоВременноеХранилище(Структура, АдресХранилища);
		
	КонецЕсли;

	Структура 		= Новый Структура("ШаблонСДанными",ШаблонСДанными);
	АдресХранилища	= ПоместитьВоВременноеХранилище(Структура, АдресХранилища);
	
КонецПроцедуры

Процедура ПоказатьСмету(ПараметрыВызоваСервера,АдресХранилища,ПоАкту) Экспорт
	
	ШаблонСДанными = ПараметрыВызоваСервера.ШаблонСДанными;
	ДеревоСмета = СоздатьДерево();
	
	СМ_СметныйСоставВызовСервера.ВывестиОбновитьДерево(ПараметрыВызоваСервера.Смета, ДеревоСмета);
	ПроставитьУровень(ДеревоСмета.Строки,0,ПоАкту);
	
	Макет 			= Обработки.СМ_СравнениеСмет.ПолучитьМакет("МакетПросмотр");
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
	ШаблонСДанными.Вывести(ОбластьШапка);	
	
	ОбластьРаздел = Макет.ПолучитьОбласть("ОбластьРаздел");
	ОбластьПозиция = Макет.ПолучитьОбласть("ОбластьПозиция");
	
	Корень = ДеревоСмета.Строки[0];
	ОбластьРаздел.Параметры.Заполнить(Корень);
	Корень.Обработано = Истина;
	
	
	ШаблонСДанными.НачатьАвтогруппировкуСтрок();
	ШаблонСДанными.Вывести(ОбластьРаздел,0);
	
	ВывестиУровеньПросмотр(ШаблонСДанными,Макет,Корень.Строки,Корень,1);
	
	ШаблонСДанными.ЗакончитьАвтогруппировкуСтрок();
	
	Структура = Новый Структура("ШаблонСДанными",ШаблонСДанными);
	АдресХранилища = ПоместитьВоВременноеХранилище(Структура, АдресХранилища);
КонецПроцедуры

Функция СоздатьДерево()
	
	ДеревоСмета1 = Новый ДеревоЗначений;
	ДеревоСмета1.Колонки.Добавить("Элемент");
	ДеревоСмета1.Колонки.Добавить("НомерПП");
	ДеревоСмета1.Колонки.Добавить("Расчет");
	ДеревоСмета1.Колонки.Добавить("ОбоснСметнойСтоим");
	ДеревоСмета1.Колонки.Добавить("НаимРаботИЗатрат");
	ДеревоСмета1.Колонки.Добавить("Кол");
	ДеревоСмета1.Колонки.Добавить("Измеритель");
	ДеревоСмета1.Колонки.Добавить("СтоимостьЕдиницы");
	ДеревоСмета1.Колонки.Добавить("ЕдВсего");
	ДеревоСмета1.Колонки.Добавить("ЕдОснЗП");
	ДеревоСмета1.Колонки.Добавить("ЕдЭксплМашин");
	ДеревоСмета1.Колонки.Добавить("ЕдЭМЗарПлата");
	ДеревоСмета1.Колонки.Добавить("ЕдСтоимостьМатериалов");
	ДеревоСмета1.Колонки.Добавить("ОбщаяСтоимость");
	ДеревоСмета1.Колонки.Добавить("ОбщВсего");
	ДеревоСмета1.Колонки.Добавить("ОбщОснЗП");
	ДеревоСмета1.Колонки.Добавить("ОбщЭксплМашин");
	ДеревоСмета1.Колонки.Добавить("ОбщЭМЗарПлата");
	ДеревоСмета1.Колонки.Добавить("ОбщСтоимостьМатериалов");
	ДеревоСмета1.Колонки.Добавить("ЕдЗатрТрРаб");
	ДеревоСмета1.Колонки.Добавить("ЕдЗатрТрМех");
	ДеревоСмета1.Колонки.Добавить("ОбщЗатрТрРаб");
	ДеревоСмета1.Колонки.Добавить("ОбщЗатрТрМех");
	ДеревоСмета1.Колонки.Добавить("ИДРодителя");
	ДеревоСмета1.Колонки.Добавить("Наименование");
	ДеревоСмета1.Колонки.Добавить("РодительРасценки");
	ДеревоСмета1.Колонки.Добавить("Версия");
	ДеревоСмета1.Колонки.Добавить("ОбъемВсего");
	ДеревоСмета1.Колонки.Добавить("ТипСтроки");
	ДеревоСмета1.Колонки.Добавить("ИндексПересчет");
	ДеревоСмета1.Колонки.Добавить("ИндексПривязана");
	ДеревоСмета1.Колонки.Добавить("ИндексНеИндексировать");
	ДеревоСмета1.Колонки.Добавить("ИндексПоправки");
	ДеревоСмета1.Колонки.Добавить("Картинка");
	ДеревоСмета1.Колонки.Добавить("ПорНомер");
	ДеревоСмета1.Колонки.Добавить("НомерВДереве");
	ДеревоСмета1.Колонки.Добавить("НомерВПределахСметы");
	ДеревоСмета1.Колонки.Добавить("ИДПозицииВладельца");
	ДеревоСмета1.Колонки.Добавить("Уровень");
	ДеревоСмета1.Колонки.Добавить("ТНС");
	ДеревоСмета1.Колонки.Добавить("Обработано",Новый ОписаниеТипов("Булево"));
	ДеревоСмета1.Колонки.Добавить("ПроверкаЗаполненияРеквизитов",Новый ОписаниеТипов("Булево"));

	Возврат ДеревоСмета1;
	
КонецФункции

Функция ПолучитьСписокДляСравнения()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Расчет","Расчет1");
	Соответствие.Вставить("ОбоснСметнойСтоим","ОбоснСметнойСтоим1");
	Соответствие.Вставить("НаимРаботИЗатрат","НаимРаботИЗатрат1");
	Соответствие.Вставить("Кол","Кол1");
	Соответствие.Вставить("Измеритель","Измеритель1");
	Соответствие.Вставить("СтоимостьЕдиницы","СтоимостьЕдиницы1");
	Соответствие.Вставить("ЕдВсего","ЕдВсего1");
	Соответствие.Вставить("ЕдОснЗП","ЕдОснЗП1");
	Соответствие.Вставить("ЕдЭксплМашин","ЕдЭксплМашин1");
	Соответствие.Вставить("ЕдЭМЗарПлата","ЕдЭМЗарПлата1");
	Соответствие.Вставить("ЕдСтоимостьМатериалов","ЕдСтоимостьМатериалов1");
	Соответствие.Вставить("ОбщаяСтоимость","ОбщаяСтоимость1");
	Соответствие.Вставить("ОбщВсего","ОбщВсего1");
	Соответствие.Вставить("ОбщОснЗП","ОбщОснЗП1");
	Соответствие.Вставить("ОбщЭксплМашин","ОбщЭксплМашин1");
	Соответствие.Вставить("ОбщЭМЗарПлата","ОбщЭМЗарПлата1");
	Соответствие.Вставить("ОбщСтоимостьМатериалов","ОбщСтоимостьМатериалов1");
	Соответствие.Вставить("ЕдЗатрТрРаб","ЕдЗатрТрРаб1");
	Соответствие.Вставить("ЕдЗатрТрМех","ЕдЗатрТрМех1");
	Соответствие.Вставить("ОбщЗатрТрРаб","ОбщЗатрТрРаб1");
	Соответствие.Вставить("ОбщЗатрТрМех","ОбщЗатрТрМех1");
	Соответствие.Вставить("Наименование","Наименование1");
	Соответствие.Вставить("Версия","Версия1");
	// Соответствие.Вставить("ОбъемВсего","");
	Соответствие.Вставить("ИндексПересчет","ИндексПересчет1");
	Соответствие.Вставить("ИндексПривязана","ИндексПривязана1");
	Соответствие.Вставить("ИндексНеИндексировать","ИндексНеИндексировать1");
	Соответствие.Вставить("ИндексПоправки","ИндексПоправки1");
	Соответствие.Вставить("ПорНомер","ПорНомер1");
	// Соответствие.Вставить("НомерВДереве","");
	// Соответствие.Вставить("НомерВПределахСметы","");
	Соответствие.Вставить("ТНС","ТНС1");
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьОбластиРаскраски()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Расчет",Новый Структура("Ячейка,Ячейка1","R1C5:R2C7","R1C21:R2C23"));
	Соответствие.Вставить("ОбоснСметнойСтоим",Новый Структура("Ячейка,Ячейка1","R1C3:R1C4","R1C19:R1C20"));
	Соответствие.Вставить("НаимРаботИЗатрат",Новый Структура("Ячейка,Ячейка1","R1C5:R2C7","R1C21:R2C23"));
	Соответствие.Вставить("Кол",Новый Структура("Ячейка,Ячейка1","R1C8","R1C24"));
	Соответствие.Вставить("Измеритель",Новый Структура("Ячейка,Ячейка1","R2C8","R2C24"));
	Соответствие.Вставить("СтоимостьЕдиницы",Новый Структура("Ячейка,Ячейка1","R1C5:R2C7","R1C21:R2C23"));
	Соответствие.Вставить("ЕдВсего",Новый Структура("Ячейка,Ячейка1","R1C9","R1C25"));
	Соответствие.Вставить("ЕдОснЗП",Новый Структура("Ячейка,Ячейка1","R2C9","R2C25"));
	Соответствие.Вставить("ЕдЭксплМашин",Новый Структура("Ячейка,Ячейка1","R1C10","R1C26"));
	Соответствие.Вставить("ЕдЭМЗарПлата",Новый Структура("Ячейка,Ячейка1","R2C10","R2C26"));
	Соответствие.Вставить("ЕдСтоимостьМатериалов",Новый Структура("Ячейка,Ячейка1","R1C11","R1C27"));
	Соответствие.Вставить("ОбщаяСтоимость",Новый Структура("Ячейка,Ячейка1","R1C5:R2C7","R1C21:R2C23"));
	Соответствие.Вставить("ОбщВсего",Новый Структура("Ячейка,Ячейка1","R1C12","R1C28"));
	Соответствие.Вставить("ОбщОснЗП",Новый Структура("Ячейка,Ячейка1","R2C12","R2C28"));
	Соответствие.Вставить("ОбщЭксплМашин",Новый Структура("Ячейка,Ячейка1","R1C13","R1C29"));
	Соответствие.Вставить("ОбщЭМЗарПлата",Новый Структура("Ячейка,Ячейка1","R2C13","R2C29"));
	Соответствие.Вставить("ОбщСтоимостьМатериалов",Новый Структура("Ячейка,Ячейка1","R1C14","R1C30"));
	Соответствие.Вставить("ЕдЗатрТрРаб",Новый Структура("Ячейка,Ячейка1","R1C15","R1C31"));
	Соответствие.Вставить("ЕдЗатрТрМех",Новый Структура("Ячейка,Ячейка1","R2C15","R2C31"));
	Соответствие.Вставить("ОбщЗатрТрРаб",Новый Структура("Ячейка,Ячейка1","R1C16","R1C32"));
	Соответствие.Вставить("ОбщЗатрТрМех",Новый Структура("Ячейка,Ячейка1","R2C16","R2C32"));
	Соответствие.Вставить("Наименование",Новый Структура("Ячейка,Ячейка1","R1C5:R2C7","R1C21:R2C23"));
	Соответствие.Вставить("Версия",Новый Структура("Ячейка,Ячейка1","R2C3:R2C4","R2C19:R2C20"));
	Соответствие.Вставить("ИндексПересчет",Новый Структура("Ячейка,Ячейка1","R1C5:R2C7","R1C21:R2C23"));
	Соответствие.Вставить("ИндексПривязана",Новый Структура("Ячейка,Ячейка1","R1C5:R2C7","R1C21:R2C23"));
	Соответствие.Вставить("ИндексНеИндексировать",Новый Структура("Ячейка,Ячейка1","R1C5:R2C7","R1C21:R2C23"));
	Соответствие.Вставить("ИндексПоправки",Новый Структура("Ячейка,Ячейка1","R1C5:R2C7","R1C21:R2C23"));
	Соответствие.Вставить("ПорНомер",Новый Структура("Ячейка,Ячейка1","R1C2:R2C2","R1C18:R2C18"));
	Соответствие.Вставить("ТНС",Новый Структура("Ячейка,Ячейка1","R1C5:R2C7","R1C21:R2C23"));
	
	Возврат Соответствие;
	
КонецФункции

Процедура ПроставитьУровень(СтрокиДерева,Уровень,ПоАкту)
	
	Для Каждого стр Из СтрокиДерева Цикл
		Если ПоАкту Тогда
			Если ТипЗнч(Стр.Элемент) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
				Стр.Кол	= Стр.ОбъемПоАкту;
			КонецЕсли;
		КонецЕсли;
		
		Если стр.ТипСтроки <= 1 Тогда
			стр.Уровень = Уровень;
			ПроставитьУровень(стр.Строки,Уровень+1,ПоАкту);
		Иначе
			стр.ТНС = стр.Элемент.ТипНормативныхСборников;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПереименуемКолонкиДерева(Дерево)
	
	Для Каждого кол Из Дерево.Колонки Цикл
		кол.Имя = кол.Имя+"1";
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьОтборРасценок(ПоляПоиска)
	
	ТекстОтбора = "ОрборРасценок = Новый Структура(""";
	
	Для Каждого стр из ПоляПоиска Цикл
		Если Не стр.Поиск Тогда
			Продолжить;
		КонецЕсли;
		ТекстОтбора = ТекстОтбора+стр.ИмяРеквизита+",";
	КонецЦикла;
	ТекстОтбора = Лев(ТекстОтбора,СтрДлина(ТекстОтбора)-1)+""",";
	
	Для Каждого стр из ПоляПоиска Цикл
		Если Не стр.Поиск Тогда
			Продолжить;
		КонецЕсли;
		ТекстОтбора = ТекстОтбора+"стр."+стр.ИмяРеквизитаДоп+",";
	КонецЦикла;
	ТекстОтбора = Лев(ТекстОтбора,СтрДлина(ТекстОтбора)-1)+")";
	
	Возврат ТекстОтбора;
	
КонецФункции

Процедура ВывестиУровень(ШаблонСДанными,РеквизитыСравнения,ОбластиРаскраски,Макет,СтрокиДерева,СтрокиДерева2,ПолноеДерево,ТекстОтбора,Уровень,Пусто = Ложь,ТолькоОтклонения = Ложь)
	
	Для Каждого стр Из СтрокиДерева Цикл
		
		Если Стр.Обработано Тогда
			Продолжить;
		КонецЕсли;
		
		Если стр.ТипСтроки <= 1 Тогда // разделы.
			
			СтрокаСравнения = Неопределено;
			Если СтрокиДерева2 = Неопределено Тогда
				МассивСтрок = ПолноеДерево.Строки.НайтиСтроки(Новый Структура("Наименование1,Уровень1,Обработано1",стр.Наименование,стр.Уровень,Ложь),Истина)
			Иначе
				МассивСтрок = СтрокиДерева2.НайтиСтроки(Новый Структура("Наименование1,Уровень1,Обработано1",стр.Наименование,стр.Уровень,Ложь),Истина)
			КонецЕсли;
			
			Если МассивСтрок.Количество()>0 Тогда
				СтрокаСравнения = МассивСтрок[0];
			КонецЕсли;
			
			Если Не СтрокаСравнения = Неопределено Тогда
				СтрокаСравнения.Обработано1 = Истина;
				ОбластьРаздел = Макет.ПолучитьОбласть("ОбластьРаздел");
				ОбластьРаздел.Параметры.Заполнить(стр);
				ОбластьРаздел.Параметры.Заполнить(СтрокаСравнения);
				ШаблонСДанными.Вывести(ОбластьРаздел,Уровень);
				ВывестиУровень(ШаблонСДанными,РеквизитыСравнения,ОбластиРаскраски,Макет,стр.Строки,СтрокаСравнения.Строки,ПолноеДерево,ТекстОтбора,Уровень+1,,ТолькоОтклонения);
				
				МассивСтрок = СтрокаСравнения.Строки.НайтиСтроки(Новый Структура("Обработано1",Ложь),Ложь);
				ВывестиНеОбработанные(ШаблонСДанными,Макет,МассивСтрок,Уровень+1,Ложь);
				
				МассивСтрок = ПолноеДерево.Строки.НайтиСтроки(Новый Структура("Уровень1,Обработано1",стр.Уровень+1,Ложь),Ложь);
				ВывестиНеОбработанные(ШаблонСДанными,Макет,МассивСтрок,Уровень,Ложь);
			Иначе
				ОбластьРаздел = Макет.ПолучитьОбласть("ОбластьРазделПусто");
				ОбластьРаздел.Параметры.Заполнить(стр);
				ШаблонСДанными.Вывести(ОбластьРаздел,Уровень);
				ВывестиУровень(ШаблонСДанными,РеквизитыСравнения,ОбластиРаскраски,Макет,стр.Строки,Неопределено,ПолноеДерево,ТекстОтбора,Уровень+1,Истина,ТолькоОтклонения);
			КонецЕсли;
			
		Иначе // позиции.
			
			Если Пусто Тогда // позиции не найденного раздела.
				
				Если стр.ТипСтроки = 2 Тогда
					ОбластьПозиция = Макет.ПолучитьОбласть("ОбластьПусто");
					ОбластьПозиция.Параметры.Заполнить(стр);
					ШаблонСДанными.Вывести(ОбластьПозиция,Уровень);
				Иначе
					ОбластьПозиция = Макет.ПолучитьОбласть("ОбластьПодчиненПусто");
					ОбластьПозиция.Параметры.Заполнить(стр);
					ШаблонСДанными.Вывести(ОбластьПозиция,Уровень+1);
				КонецЕсли;
				
			Иначе 
				
				ОрборРасценок = "";
				Выполнить(ТекстОтбора);
				ОрборРасценок.Вставить("ТипСтроки1",стр.ТипСтроки);
				ОрборРасценок.Вставить("Обработано1",Ложь);
				МассивСтрок = СтрокиДерева2.НайтиСтроки(ОрборРасценок,Ложь);

				СтрокаСравнения = Неопределено;
				Если МассивСтрок.Количество()>0 Тогда
					СтрокаСравнения = МассивСтрок[0];
					СтрокаСравнения.Обработано1 = Истина;
				КонецЕсли;

				Если СтрокаСравнения = Неопределено Тогда // не нашли позицию.
					
					Если стр.ТипСтроки = 2 Тогда
						ОбластьПозиция = Макет.ПолучитьОбласть("ОбластьПусто");
						ОбластьПозиция.Параметры.Заполнить(стр);
						ШаблонСДанными.Вывести(ОбластьПозиция,Уровень);
					Иначе
						ОбластьПозиция = Макет.ПолучитьОбласть("ОбластьПодчиненПусто");
						ОбластьПозиция.Параметры.Заполнить(стр);
						ШаблонСДанными.Вывести(ОбластьПозиция,Уровень+1);
					КонецЕсли;

				Иначе
					
					// обработаем разделенные
					ОрборРасценок = "";
					ТекстОтбораДоп = СтрЗаменить(ТекстОтбора,"1","");
					Выполнить(ТекстОтбораДоп);
					ОрборРасценок.Вставить("ТипСтроки",стр.ТипСтроки);
					ОрборРасценок.Вставить("Наименование",стр.Наименование);
					ОрборРасценок.Вставить("Измеритель",стр.Измеритель); 
					ОрборРасценок.Вставить("Обработано",Ложь);
					МассивСтрокДоп = стр.Родитель.Строки.НайтиСтроки(ОрборРасценок,Ложь);
					ТекСтрока = МассивСтрокДоп.Найти(стр);
					МассивСтрокДоп.Удалить(ТекСтрока);
					
					Для Каждого СтрДоп Из МассивСтрокДоп Цикл
						 стр.Кол 					= стр.Кол + СтрДоп.Кол;
						 стр.ОбщВсего 				= стр.ОбщВсего + СтрДоп.ОбщВсего;
						 стр.ОбщЗатрТрМех 			= стр.ОбщЗатрТрМех + СтрДоп.ОбщЗатрТрМех;
						 стр.ОбщЗатрТрРаб 			= стр.ОбщЗатрТрРаб + СтрДоп.ОбщЗатрТрРаб;
						 стр.ОбщОснЗП	 			= стр.ОбщОснЗП + СтрДоп.ОбщОснЗП;
						 стр.ОбщСтоимостьМатериалов = стр.ОбщСтоимостьМатериалов + СтрДоп.ОбщСтоимостьМатериалов;
						 стр.ОбщЭМЗарПлата 			= стр.ОбщЭМЗарПлата + СтрДоп.ОбщЭМЗарПлата;
						 стр.ОбщЭксплМашин 			= стр.ОбщЭксплМашин + СтрДоп.ОбщЭксплМашин;
						 стр.ОбъемВсего 			= стр.ОбъемВсего + СтрДоп.ОбъемВсего;
						 СтрДоп.Обработано 			= Истина;
					КонецЦикла;
					
					// обработаем разделенные
					ТекСтрока = МассивСтрок.Найти(СтрокаСравнения);
					МассивСтрок.Удалить(ТекСтрока);
					Для Каждого СтрДоп Из МассивСтрок Цикл
						СтрокаСравнения.Кол1 					= СтрокаСравнения.Кол1 + СтрДоп.Кол1;
						СтрокаСравнения.ОбщВсего1 				= СтрокаСравнения.ОбщВсего1 + СтрДоп.ОбщВсего1;
						СтрокаСравнения.ОбщЗатрТрМех1 			= СтрокаСравнения.ОбщЗатрТрМех1 + СтрДоп.ОбщЗатрТрМех1;
						СтрокаСравнения.ОбщЗатрТрРаб1 			= СтрокаСравнения.ОбщЗатрТрРаб1 + СтрДоп.ОбщЗатрТрРаб1;
						СтрокаСравнения.ОбщОснЗП1 				= СтрокаСравнения.ОбщОснЗП1 + СтрДоп.ОбщОснЗП1;
						СтрокаСравнения.ОбщСтоимостьМатериалов1 = СтрокаСравнения.ОбщСтоимостьМатериалов1 + СтрДоп.ОбщСтоимостьМатериалов1;
						СтрокаСравнения.ОбщЭМЗарПлата1 			= СтрокаСравнения.ОбщЭМЗарПлата1 + СтрДоп.ОбщЭМЗарПлата1;
						СтрокаСравнения.ОбщЭксплМашин1 			= СтрокаСравнения.ОбщЭксплМашин1 + СтрДоп.ОбщЭксплМашин1;
						СтрокаСравнения.ОбъемВсего1 			= СтрокаСравнения.ОбъемВсего1 + СтрДоп.ОбъемВсего1;
						СтрДоп.Обработано1 						= Истина;
					КонецЦикла;

					СписокРазличий = СверитьДанныеПозиций(стр,СтрокаСравнения,РеквизитыСравнения);
					ЕстьРазличия = СписокРазличий.Количество() > 0;
					
					Если ТолькоОтклонения И Не ЕстьРазличия Тогда
						Продолжить;
					КонецЕсли;
					
					Если стр.ТипСтроки = 2 Тогда
						ОбластьПозиция = ?(ЕстьРазличия,Макет.ПолучитьОбласть("ОбластьРазличия"),Макет.ПолучитьОбласть("ОбластьПозиция"));
						
						Если ЕстьРазличия Тогда
							ЦветЯчейки = Новый Цвет(255, 235, 205); 
							Для Каждого эл Из СписокРазличий Цикл
								Ячейки	 			= ОбластиРаскраски[эл.Значение];
								Ячейка 				= ОбластьПозиция.Область(Ячейки.Ячейка);
								Ячейка1 			= ОбластьПозиция.Область(Ячейки.Ячейка1);
								Ячейка.ЦветФона 	= ЦветЯчейки;
								Ячейка1.ЦветФона 	= ЦветЯчейки;
							КонецЦикла;
						КонецЕсли;

						ОбластьПозиция.Параметры.Заполнить(стр);
						ОбластьПозиция.Параметры.Заполнить(СтрокаСравнения);
						ШаблонСДанными.Вывести(ОбластьПозиция,Уровень);
					Иначе
						ОбластьПозиция = ?(ЕстьРазличия,Макет.ПолучитьОбласть("ОбластьПодчиненРазличия"),Макет.ПолучитьОбласть("ОбластьПодчинен"));
						Если ЕстьРазличия Тогда
							ЦветЯчейки = Новый Цвет(255, 235, 205); 
							Для Каждого эл Из СписокРазличий Цикл
								Ячейки = ОбластиРаскраски[эл.Значение];
								Ячейка = ОбластьПозиция.Область(Ячейки.Ячейка);
								Ячейка1 = ОбластьПозиция.Область(Ячейки.Ячейка1);
								Ячейка.ЦветФона = ЦветЯчейки;
								Ячейка1.ЦветФона = ЦветЯчейки;
							КонецЦикла;
						КонецЕсли;
						ОбластьПозиция.Параметры.Заполнить(стр);
						ОбластьПозиция.Параметры.Заполнить(СтрокаСравнения);
						ШаблонСДанными.Вывести(ОбластьПозиция,Уровень+1);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиНеОбработанные(ШаблонСДанными,Макет,МассивСтрок,Уровень,ИскатьПодчиненные = Истина)
	
	Для Каждого стр Из МассивСтрок Цикл
		
		Если стр.Обработано1 Тогда
			Продолжить;
		КонецЕсли;
		
		Если стр.ТипСтроки1 <= 1 Тогда // разделы.
			стр.Обработано1 = Истина;
			ОбластьРаздел = Макет.ПолучитьОбласть("ОбластьРазделПусто");
			ОбластьРаздел.Параметры.Заполнить(стр);
			ШаблонСДанными.Вывести(ОбластьРаздел,Уровень);
			
			МассивСтрокНовый = стр.Строки.НайтиСтроки(Новый Структура("Обработано1",Ложь),ИскатьПодчиненные);
			ВывестиНеОбработанные(ШаблонСДанными,Макет,МассивСтрокНовый,Уровень+1);
			
		Иначе // позиции.
			стр.Обработано1 = Истина;
			Если стр.ТипСтроки1 = 2 Тогда
				ОбластьПозиция = Макет.ПолучитьОбласть("ОбластьПусто");
				ОбластьПозиция.Параметры.Заполнить(стр);
				ШаблонСДанными.Вывести(ОбластьПозиция,Уровень);
			Иначе
				ОбластьПозиция = Макет.ПолучитьОбласть("ОбластьПодчиненПусто");
				ОбластьПозиция.Параметры.Заполнить(стр);
				ШаблонСДанными.Вывести(ОбластьПозиция,Уровень+1);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СверитьДанныеПозиций(СтрокаЭталон,СтрокаСравнения,РеквизитыСравнения)
	
	СписокРазличий = Новый СписокЗначений;
	
	Для Каждого КлючИЗначение Из РеквизитыСравнения Цикл
		Если Не СтрокаЭталон[КлючИЗначение.Ключ] = СтрокаСравнения[КлючИЗначение.Значение] Тогда
			СписокРазличий.Добавить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокРазличий;
	
КонецФункции

Процедура ВывестиУровеньПросмотр(ШаблонСДанными,Макет,СтрокиДерева,ПолноеДерево,Уровень)
	
	Для Каждого стр Из СтрокиДерева Цикл
		Если стр.ТипСтроки <= 1 Тогда // разделы.
			ОбластьРаздел = Макет.ПолучитьОбласть("ОбластьРаздел");
			ОбластьРаздел.Параметры.Заполнить(стр);
			ШаблонСДанными.Вывести(ОбластьРаздел,Уровень);
			ВывестиУровеньПросмотр(ШаблонСДанными,Макет,стр.Строки,ПолноеДерево,Уровень+1);
		Иначе // позиции.
			Если стр.ТипСтроки = 2 Тогда
				ОбластьПозиция = Макет.ПолучитьОбласть("ОбластьПозиция");
				ОбластьПозиция.Параметры.Заполнить(стр);
				ШаблонСДанными.Вывести(ОбластьПозиция,Уровень);
			Иначе
				ОбластьПозиция = Макет.ПолучитьОбласть("ОбластьПодчинен");
				ОбластьПозиция.Параметры.Заполнить(стр);
				ШаблонСДанными.Вывести(ОбластьПозиция,Уровень+1);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьДеревоАкта()
	
	ДопустимыеТипы = Новый ОписаниеТипов("Число");
	
	ДеревоСмета1 = Новый ДеревоЗначений;
	ДеревоСмета1.Колонки.Добавить("Элемент");
	ДеревоСмета1.Колонки.Добавить("НомерПП");
	ДеревоСмета1.Колонки.Добавить("Расчет");
	ДеревоСмета1.Колонки.Добавить("ОбоснСметнойСтоим");
	ДеревоСмета1.Колонки.Добавить("НаимРаботИЗатрат");
	ДеревоСмета1.Колонки.Добавить("Кол");
	ДеревоСмета1.Колонки.Добавить("Измеритель");
	ДеревоСмета1.Колонки.Добавить("СтоимостьЕдиницы");
	ДеревоСмета1.Колонки.Добавить("ЕдВсего");
	ДеревоСмета1.Колонки.Добавить("ЕдОснЗП");
	ДеревоСмета1.Колонки.Добавить("ЕдЭксплМашин");
	ДеревоСмета1.Колонки.Добавить("ЕдЭМЗарПлата");
	ДеревоСмета1.Колонки.Добавить("ЕдСтоимостьМатериалов");
	ДеревоСмета1.Колонки.Добавить("ОбщаяСтоимость");
	ДеревоСмета1.Колонки.Добавить("ОбщВсего");
	ДеревоСмета1.Колонки.Добавить("ОбщОснЗП");
	ДеревоСмета1.Колонки.Добавить("ОбщЭксплМашин");
	ДеревоСмета1.Колонки.Добавить("ОбщЭМЗарПлата");
	ДеревоСмета1.Колонки.Добавить("ОбщСтоимостьМатериалов");
	ДеревоСмета1.Колонки.Добавить("ЕдЗатрТрРаб");
	ДеревоСмета1.Колонки.Добавить("ЕдЗатрТрМех");
	ДеревоСмета1.Колонки.Добавить("ОбщЗатрТрРаб");
	ДеревоСмета1.Колонки.Добавить("ОбщЗатрТрМех");
	ДеревоСмета1.Колонки.Добавить("Наименование");
	ДеревоСмета1.Колонки.Добавить("Версия");
	ДеревоСмета1.Колонки.Добавить("ОбъемВсего",ДопустимыеТипы);
	ДеревоСмета1.Колонки.Добавить("ТипСтроки");
	ДеревоСмета1.Колонки.Добавить("ИндексПересчет");
	ДеревоСмета1.Колонки.Добавить("ИндексПривязана");
	ДеревоСмета1.Колонки.Добавить("ИндексНеИндексировать");
	ДеревоСмета1.Колонки.Добавить("ИндексПоправки");
	ДеревоСмета1.Колонки.Добавить("Картинка");
	ДеревоСмета1.Колонки.Добавить("Уровень");
	ДеревоСмета1.Колонки.Добавить("ТНС");
	ДеревоСмета1.Колонки.Добавить("Обработано",Новый ОписаниеТипов("Булево"));
	ДеревоСмета1.Колонки.Добавить("ЕстьФайл");
	ДеревоСмета1.Колонки.Добавить("Звездочка");
	ДеревоСмета1.Колонки.Добавить("ОбъемВсегоПроцент");
	ДеревоСмета1.Колонки.Добавить("ОбъемПоАкту",ДопустимыеТипы);
	ДеревоСмета1.Колонки.Добавить("ОбъемПоАктуПроцент");
	ДеревоСмета1.Колонки.Добавить("ОтмеченаВДереве");
	ДеревоСмета1.Колонки.Добавить("Плюсик");
	ДеревоСмета1.Колонки.Добавить("Пустышка");
	ДеревоСмета1.Колонки.Добавить("СтатусРедактирования");
	ДеревоСмета1.Колонки.Добавить("СтатусРесурса");
	ДеревоСмета1.Колонки.Добавить("УдалитьСтатусРесурсаАкт");
	ДеревоСмета1.Колонки.Добавить("ПроверкаЗаполненияРеквизитов",Новый ОписаниеТипов("Булево"));

	Возврат ДеревоСмета1;
	
КонецФункции

Функция ПолучитьСписокДляСравненияАкт()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Расчет","Расчет1");
	Соответствие.Вставить("ОбоснСметнойСтоим","ОбоснСметнойСтоим1");
	Соответствие.Вставить("НаимРаботИЗатрат","НаимРаботИЗатрат1");
	Соответствие.Вставить("Кол","Кол1");
	Соответствие.Вставить("Измеритель","Измеритель1");
	Соответствие.Вставить("СтоимостьЕдиницы","СтоимостьЕдиницы1");
	Соответствие.Вставить("ЕдВсего","ЕдВсего1");
	Соответствие.Вставить("ЕдОснЗП","ЕдОснЗП1");
	Соответствие.Вставить("ЕдЭксплМашин","ЕдЭксплМашин1");
	Соответствие.Вставить("ЕдЭМЗарПлата","ЕдЭМЗарПлата1");
	Соответствие.Вставить("ЕдСтоимостьМатериалов","ЕдСтоимостьМатериалов1");
	Соответствие.Вставить("ОбщаяСтоимость","ОбщаяСтоимость1");
	Соответствие.Вставить("ОбщВсего","ОбщВсего1");
	Соответствие.Вставить("ОбщОснЗП","ОбщОснЗП1");
	Соответствие.Вставить("ОбщЭксплМашин","ОбщЭксплМашин1");
	Соответствие.Вставить("ОбщЭМЗарПлата","ОбщЭМЗарПлата1");
	Соответствие.Вставить("ОбщСтоимостьМатериалов","ОбщСтоимостьМатериалов1");
	Соответствие.Вставить("ЕдЗатрТрРаб","ЕдЗатрТрРаб1");
	Соответствие.Вставить("ЕдЗатрТрМех","ЕдЗатрТрМех1");
	Соответствие.Вставить("ОбщЗатрТрРаб","ОбщЗатрТрРаб1");
	Соответствие.Вставить("ОбщЗатрТрМех","ОбщЗатрТрМех1");
	Соответствие.Вставить("Наименование","Наименование1");
	Соответствие.Вставить("Версия","Версия1");
	Соответствие.Вставить("ИндексПересчет","ИндексПересчет1");
	Соответствие.Вставить("ИндексПривязана","ИндексПривязана1");
	Соответствие.Вставить("ИндексНеИндексировать","ИндексНеИндексировать1");
	Соответствие.Вставить("ИндексПоправки","ИндексПоправки1");
	Соответствие.Вставить("ТНС","ТНС1");
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьЕдиничнуюСтоимостьПозиций(ТекСмета,ТекАкт)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СМ_АктВыполненныхРаботПозиции.Ссылка,
	|	СМ_АктВыполненныхРаботПозиции.ФактОбъем,
	|	СМ_АктВыполненныхРаботПозиции.Позиция,
	|	СМ_АктВыполненныхРаботПозиции.Ссылка.ЛокальнаяСмета
	|ПОМЕСТИТЬ ПозицииАкта
	|ИЗ
	|	Документ.СМ_АктВыполненныхРабот.Позиции КАК СМ_АктВыполненныхРаботПозиции
	|ГДЕ
	|	СМ_АктВыполненныхРаботПозиции.Ссылка.ЛокальнаяСмета = &Смета И
	|	СМ_АктВыполненныхРаботПозиции.Ссылка = &Акт
	|;
	|	
	|ВЫБРАТЬ
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ДопЗМ,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ЗатратыТрудаМашин,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ЗатратыТрудаРабочих,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимВозвратМатер,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЗарплМашин,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОборуд,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОснЗарплата,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимПрямЗатраты,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимСтоимМатер,
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЭксплМашин,
	|   ПозицииАкта.ФактОбъем
	|ИЗ
	|	РегистрСведений.СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета КАК СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПозицииАкта КАК ПозицииАкта 
	|	ПО СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция = ПозицииАкта.Позиция
	|ГДЕ
	|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета = &Смета
	|УПОРЯДОЧИТЬ ПО
	| 	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция";
	
	Запрос.УстановитьПараметр("Смета",ТекСмета);
	Запрос.УстановитьПараметр("Акт",ТекАкт);
	
	ТабРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабРезультат;
		
КонецФункции

// Единичная стоимость берется по регистру "СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета".
// Единичные стоимости по позициям сразу соединяется с объемом по акту.
// Итоги перасчитываются суммированием по разделам / смете.
Процедура ПересчетДереваПоАктуДанныеРегистра(ДеревоСметы,ТабСтоимости)
	
	// Пересчет дерева по позициям акта
	Для Каждого ТекСтрока Из ДеревоСметы.Строки Цикл
		Если ТипЗнч(ТекСтрока.Элемент) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
			НайденнаяСтрока = ТабСтоимости.Найти(ТекСтрока.Элемент,"Позиция");
			Если НайденнаяСтрока <> Неопределено Тогда
				// Здесь нужно рассчитать стоимость по акту
				ОбъемПоАкту							= НайденнаяСтрока.ФактОбъем;
				ТекСтрока.Кол						= ОбъемПоАкту;
				ТекСтрока.ОбщВсего 				  	= НайденнаяСтрока.СтоимПрямЗатраты * ОбъемПоАкту;
				ТекСтрока.ОбщОснЗП                	= НайденнаяСтрока.СтоимОснЗарплата * ОбъемПоАкту;
				ТекСтрока.ОбщЭксплМашин           	= НайденнаяСтрока.СтоимЭксплМашин * ОбъемПоАкту;
				ТекСтрока.ОбщЭМЗарПлата           	= НайденнаяСтрока.СтоимЗарплМашин * ОбъемПоАкту;
				ТекСтрока.ОбщСтоимостьМатериалов	= НайденнаяСтрока.СтоимСтоимМатер * ОбъемПоАкту;
				ТекСтрока.ОбщЗатрТрРаб            	= НайденнаяСтрока.ЗатратыТрудаРабочих * ОбъемПоАкту;
				ТекСтрока.ОбщЗатрТрМех            	= НайденнаяСтрока.ЗатратыТрудаМашин * ОбъемПоАкту;
				ПересчитатьИтогиВладельца(ТекСтрока.Родитель,ТекСтрока);
			КонецЕсли;
		Иначе
			// Обнуление итогов владельца
			ТекСтрока.ОбщВсего 					= 0;
			ТекСтрока.ОбщОснЗП                	= 0;
			ТекСтрока.ОбщЭксплМашин           	= 0;
			ТекСтрока.ОбщЭМЗарПлата           	= 0;
			ТекСтрока.ОбщСтоимостьМатериалов  	= 0;
			ТекСтрока.ОбщЗатрТрРаб            	= 0;
			ТекСтрока.ОбщЗатрТрМех            	= 0;
		КонецЕсли;
		
		Если ТекСтрока.Строки.Количество() > 0 Тогда
			ПересчетДереваПоАктуДанныеРегистра(ТекСтрока,ТабСтоимости);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПересчитатьИтогиВладельца(ТекРодитель,ТекСтрока)
	
	ТекРодитель.ОбщВсего 				= ТекРодитель.ОбщВсего + ТекСтрока.ОбщВсего;
	ТекРодитель.ОбщОснЗП                = ТекРодитель.ОбщОснЗП + ТекСтрока.ОбщОснЗП;
	ТекРодитель.ОбщЭксплМашин           = ТекРодитель.ОбщЭксплМашин + ТекСтрока.ОбщЭксплМашин;
	ТекРодитель.ОбщЭМЗарПлата           = ТекРодитель.ОбщЭМЗарПлата + ТекСтрока.ОбщЭМЗарПлата;
	ТекРодитель.ОбщСтоимостьМатериалов  = ТекРодитель.ОбщСтоимостьМатериалов + ТекСтрока.ОбщСтоимостьМатериалов;
	ТекРодитель.ОбщЗатрТрРаб            = ТекРодитель.ОбщЗатрТрРаб + ТекСтрока.ОбщЗатрТрРаб;
	ТекРодитель.ОбщЗатрТрМех            = ТекРодитель.ОбщЗатрТрМех + ТекСтрока.ОбщЗатрТрМех;
	
	Если ТекРодитель.Родитель <> Неопределено Тогда
		ПересчитатьИтогиВладельца(ТекРодитель.Родитель,ТекСтрока);
	КонецЕсли;
	
КонецПроцедуры

Функция СверитьДанныеСмет(СтрокаЭталон,СтрокаСравнения,РеквизитыСравнения)
	
	ЕстьРазличия = Ложь;
	Для Каждого КлючИЗначение Из РеквизитыСравнения Цикл
		Если Не СтрокаЭталон[КлючИЗначение.Ключ] = СтрокаСравнения[КлючИЗначение.Значение] Тогда
			ЕстьРазличия = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьРазличия;
	
КонецФункции

// Сравнение объектных смет
Процедура ВывестиДанныеПоОС(ШаблонСДанными,РеквизитыСравнения,Макет,ТабДанных1,ТабДанных2,ТаблицаДанныхОС,ТипСтроительства)
	
	ПовторИтога 	= 0;
	ПовторИтога1 	= 0;
	НомПП			= 0;
	НомПП1			= 0;
	
	Для Каждого ТекСтрока Из ТаблицаДанныхОС Цикл
		
		ВсегоПоСтроке 	= 0;
		ВсегоПоСтроке1 	= 0;
		ВыводитьСтроку 	= Истина;
		ВыводитьСтроку1 = Истина;

		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Итог",ТекСтрока.Итог);

		СтруктураОтбора1 = Новый Структура;
		СтруктураОтбора1.Вставить("Итог",ТекСтрока.Итог);

		НайденнаяСтрока 	= ТабДанных1.Найти(ТекСтрока.Итог,"Итог");
		НайденнаяСтрока1 	= ТабДанных2.Найти(ТекСтрока.Итог,"Итог1");
		
		Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда
			ВсегоПоСтроке = НайденнаяСтрока.СтроительныеРаботы + НайденнаяСтрока.МонтажныеРаботы + НайденнаяСтрока.Оборудование + НайденнаяСтрока.Прочие;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденнаяСтрока1) Тогда
			ВсегоПоСтроке1 = НайденнаяСтрока1.СтроительныеРаботы1 + НайденнаяСтрока1.МонтажныеРаботы1 + НайденнаяСтрока1.Оборудование1 + НайденнаяСтрока1.Прочие1;
		КонецЕсли;
		
		Если ТипЗнч(ТекСтрока.Итог) = Тип("СправочникСсылка.СМ_ИтогиПоГлавам") Тогда
			Если ТекСтрока.Итог.Накопительный Тогда
				Если ПовторИтога = ВсегоПоСтроке Тогда
					ВыводитьСтроку = Ложь;
				КонецЕсли;
			
				Если ПовторИтога1 = ВсегоПоСтроке1 Тогда
					ВыводитьСтроку1 = Ложь;
				КонецЕсли;
				
				ПовторИтога 	= ВсегоПоСтроке;
				ПовторИтога1 	= ВсегоПоСтроке1;
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденнаяСтрока) И ЗначениеЗаполнено(НайденнаяСтрока1) Тогда
			ЕстьРазличия = СверитьДанныеСмет(НайденнаяСтрока,НайденнаяСтрока1,РеквизитыСравнения);
			Если ЕстьРазличия Тогда
				ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаПустая");
			Иначе
				ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			КонецЕсли;
		Иначе
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаПустая");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденнаяСтрока) И ВыводитьСтроку Тогда
			ОбластьСтрока.Параметры.Заполнить(НайденнаяСтрока);		
			ОбластьСтрока.Параметры.НаименованиеСметы	= НайденнаяСтрока.Итог.Наименование;
			ОбластьСтрока.Параметры.ВсегоПоСтроке 		= ВсегоПоСтроке;
			Если НайденнаяСтрока.ЭтоСмета Тогда
				НомПП 								= НомПП + 1;
				ОбластьСтрока.Параметры.НомерСметы 	= НайденнаяСтрока.Итог.НомерСметы;	 
				ОбластьСтрока.Параметры.НомерПП		= НомПП;
			ИначеЕсли ТипЗнч(НайденнаяСтрока.Итог) = Тип("СправочникСсылка.СМ_ИтогиПоГлавам") Тогда
				Если ТипСтроительства = Перечисления.СМ_ТипыСтроительства.КапитальныйРемонт Тогда
					ОбластьСтрока.Параметры.НаименованиеСметы = НайденнаяСтрока.Итог.НаименованиеРемонт;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденнаяСтрока1) И ВыводитьСтроку1 Тогда
			ОбластьСтрока.Параметры.Заполнить(НайденнаяСтрока1);		                                                                                        
			ОбластьСтрока.Параметры.НаименованиеСметы1 	= НайденнаяСтрока1.Итог1.Наименование;
			ОбластьСтрока.Параметры.ВсегоПоСтроке1 		= ВсегоПоСтроке1;
			Если НайденнаяСтрока1.ЭтоСмета1 Тогда
				НомПП1 								= НомПП1 + 1;
				ОбластьСтрока.Параметры.НомерСметы1	= НайденнаяСтрока1.Итог1.НомерСметы;	 
				ОбластьСтрока.Параметры.НомерПП1	= НомПП1;
			ИначеЕсли ТипЗнч(НайденнаяСтрока1.Итог1) = Тип("СправочникСсылка.СМ_ИтогиПоГлавам") Тогда
				Если ТипСтроительства = Перечисления.СМ_ТипыСтроительства.КапитальныйРемонт Тогда
					ОбластьСтрока.Параметры.НаименованиеСметы1 = НайденнаяСтрока1.Итог1.НаименованиеРемонт;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ВыводитьСтроку ИЛИ ВыводитьСтроку1 Тогда
			ШаблонСДанными.Вывести(ОбластьСтрока);
		КонецЕсли;
		
	КонецЦикла;	
		
КонецПроцедуры
	
// Сравнение сводных смет
Процедура ВывестиДанныеПоСС(ШаблонСДанными,РеквизитыСравнения,Макет,ТабДанных1,ТабДанных2,ТаблицаДанныхСС,ТабГлавы,ТипСтроительства)
	
	ПовторИтога 	= 0;
	ПовторИтога1 	= 0;
	ПовторГлавы		= 0;	
	НомПП			= 0;
	НомПП1          = 0;
	
	ШаблонСДанными.НачатьАвтогруппировкуСтрок();
	
	Для Каждого СтрокаГлавы Из ТабГлавы Цикл
		
		НайденнаяГлава 	= ТабДанных1.Найти(СтрокаГлавы.Глава,"Глава");
		НайденнаяГлава1 = ТабДанных2.Найти(СтрокаГлавы.Глава,"Глава1");
		
		Если ЗначениеЗаполнено(НайденнаяГлава) И ЗначениеЗаполнено(НайденнаяГлава1) Тогда
			ОбластьГлава = Макет.ПолучитьОбласть("Глава");	
		Иначе
			ОбластьГлава = Макет.ПолучитьОбласть("ГлаваПустая");
		КонецЕсли;
		
		//ИтогПоГлаве = СМ_СметаПечатьОбъектнаяСводнаяВызовСервера.НайтиИтогПоГлаве(СтрокаГлавы.Глава,ТипСтроительства);
		
		Если ЗначениеЗаполнено(НайденнаяГлава) Тогда
			ОбластьГлава.Параметры.НаименованиеГлавы = СтрокаГлавы.Глава.Наименование;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденнаяГлава1) Тогда
			ОбластьГлава.Параметры.НаименованиеГлавы1 = СтрокаГлавы.Глава.Наименование;
		КонецЕсли;
		
		СтруктураОтбораГлав = Новый Структура;
		СтруктураОтбораГлав.Вставить("Глава",СтрокаГлавы.Глава);
		НайденныеСтрокиГлавы = ТаблицаДанныхСС.НайтиСтроки(СтруктураОтбораГлав);
		
		Если СтрокаГлавы.Всего <> ПовторГлавы Тогда
			ШаблонСДанными.Вывести(ОбластьГлава,1);
		КонецЕсли;
		
		Для Каждого ТекСтрока Из НайденныеСтрокиГлавы Цикл
			
			ВсегоПоСтроке 	= 0;
			ВсегоПоСтроке1 	= 0;
			ВыводитьСтроку 	= Истина;
			ВыводитьСтроку1 = Истина;

			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Итог",ТекСтрока.Итог);

			СтруктураОтбора1 = Новый Структура;
			СтруктураОтбора1.Вставить("Итог",ТекСтрока.Итог);

			НайденнаяСтрока 	= ТабДанных1.Найти(ТекСтрока.Итог,"Итог");
			НайденнаяСтрока1 	= ТабДанных2.Найти(ТекСтрока.Итог,"Итог1");
			
			Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда
				ВсегоПоСтроке = НайденнаяСтрока.СтроительныеРаботы + НайденнаяСтрока.МонтажныеРаботы + НайденнаяСтрока.Оборудование + НайденнаяСтрока.Прочие;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НайденнаяСтрока1) Тогда
				ВсегоПоСтроке1 = НайденнаяСтрока1.СтроительныеРаботы1 + НайденнаяСтрока1.МонтажныеРаботы1 + НайденнаяСтрока1.Оборудование1 + НайденнаяСтрока1.Прочие1;
			КонецЕсли;
			
			Если ТипЗнч(ТекСтрока.Итог) = Тип("СправочникСсылка.СМ_ИтогиПоГлавам") Тогда
				Если ТекСтрока.Итог.Накопительный Тогда
					Если ПовторИтога = ВсегоПоСтроке Тогда
						ВыводитьСтроку = Ложь;
					КонецЕсли;
				
					Если ПовторИтога1 = ВсегоПоСтроке1 Тогда
						ВыводитьСтроку1 = Ложь;
					КонецЕсли;
					
					ПовторИтога 	= ВсегоПоСтроке;
					ПовторИтога1 	= ВсегоПоСтроке1;
				Иначе
					Продолжить;
				КонецЕсли;
 			КонецЕсли;
			
			Если ЗначениеЗаполнено(НайденнаяСтрока) И ЗначениеЗаполнено(НайденнаяСтрока1) Тогда
				// Сравнение строк 
				ЕстьРазличия = СверитьДанныеСмет(НайденнаяСтрока,НайденнаяСтрока1,РеквизитыСравнения);
				Если ЕстьРазличия Тогда
					ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаПустая");
				Иначе
					ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
				КонецЕсли;
			Иначе
				ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаПустая");
			КонецЕсли;
		
			Если ЗначениеЗаполнено(НайденнаяСтрока) И ВыводитьСтроку Тогда
				ОбластьСтрока.Параметры.Заполнить(НайденнаяСтрока);		
				ОбластьСтрока.Параметры.НаименованиеСметы	= НайденнаяСтрока.Итог.Наименование;
				ОбластьСтрока.Параметры.ВсегоПоСтроке 		= ВсегоПоСтроке;
				Если НайденнаяСтрока.ЭтоСмета Тогда
					НомПП 								= НомПП + 1;
					ОбластьСтрока.Параметры.НомерСметы 	= НайденнаяСтрока.Итог.НомерСметы;	 
					ОбластьСтрока.Параметры.НомерПП		= НомПП;
				ИначеЕсли ТипЗнч(НайденнаяСтрока.Итог) = Тип("СправочникСсылка.СМ_ИтогиПоГлавам") Тогда
					Если ТипСтроительства = Перечисления.СМ_ТипыСтроительства.КапитальныйРемонт Тогда
						ОбластьСтрока.Параметры.НаименованиеСметы = НайденнаяСтрока.Итог.НаименованиеРемонт;	
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НайденнаяСтрока1) И ВыводитьСтроку1 Тогда
				ОбластьСтрока.Параметры.Заполнить(НайденнаяСтрока1);		                                                                                        
				ОбластьСтрока.Параметры.НаименованиеСметы1 	= НайденнаяСтрока1.Итог1.Наименование;
				ОбластьСтрока.Параметры.ВсегоПоСтроке1 	 	= ВсегоПоСтроке1;
				Если НайденнаяСтрока1.ЭтоСмета1 Тогда
					НомПП1 									= НомПП1 + 1;
					ОбластьСтрока.Параметры.НомерСметы1 	= НайденнаяСтрока1.Итог1.НомерСметы;	  
					ОбластьСтрока.Параметры.НомерПП1		= НомПП1;
				ИначеЕсли ТипЗнч(НайденнаяСтрока1.Итог1) = Тип("СправочникСсылка.СМ_ИтогиПоГлавам") Тогда
					Если ТипСтроительства = Перечисления.СМ_ТипыСтроительства.КапитальныйРемонт Тогда
						ОбластьСтрока.Параметры.НаименованиеСметы1 = НайденнаяСтрока1.Итог1.НаименованиеРемонт;	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ВыводитьСтроку ИЛИ ВыводитьСтроку1 Тогда
				ШаблонСДанными.Вывести(ОбластьСтрока,2);
			КонецЕсли;
			
		КонецЦикла;	
		
		ПовторГлавы = СтрокаГлавы.Всего;
		
	КонецЦикла;
	
	ШаблонСДанными.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры

#Область ПолучениеДанных

Функция СобратьДанныеПоСмете(Ссылка)
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		ТекРегистр = "СМ_ИтогиПоГлавамОС";
	Иначе
		ТекРегистр = "СМ_ИтогиПоГлавамСС";
	КонецЕсли;	
	
	Если Ссылка.БазисныеЦены Тогда
		
		Запрос 			= Новый Запрос;
		Запрос.Текст 	= "
		|ВЫБРАТЬ
		|	ИтогиПоГлавам.Смета КАК ОбъектнаяСмета,
		|	ИтогиПоГлавам.Итог КАК Итог,
		|	ИтогиПоГлавам.Глава КАК Глава,
		|	СУММА(ЕСТЬNULL(
		|		ВЫБОР КОГДА ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы) ИЛИ
		|			        ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.МеталломонтажныеРаботы) ИЛИ 
		|		 			ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.БуровзрывныеРаботы) ИЛИ 
		|		  			ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.СантехническиеРаботы) ИЛИ 
		|		  			ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.ГорнопроходческиеРаботы) ТОГДА
		|					ИтогиПоГлавам.ПрямЗатраты / 1000 ИНАЧЕ 0 КОНЕЦ,0)) КАК СтроительныеРаботы, 	  
		|	СУММА(ЕСТЬNULL(
		|		ВЫБОР КОГДА ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.МонтажныеРаботы) ТОГДА 
		|		ИтогиПоГлавам.ПрямЗатраты / 1000 ИНАЧЕ 0 КОНЕЦ,0)) КАК МонтажныеРаботы, 	  
		|	СУММА(ЕСТЬNULL(
		|		ВЫБОР КОГДА ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.Оборудование) ТОГДА 
		|		ИтогиПоГлавам.Оборуд / 1000 ИНАЧЕ 0 КОНЕЦ,0)) КАК Оборудование,  
		|	СУММА(ЕСТЬNULL(
		|		ВЫБОР КОГДА ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.ПрочиеРаботы) ТОГДА 
		|		ИтогиПоГлавам.ПрямЗатраты / 1000 ИНАЧЕ 0 КОНЕЦ,0)) КАК Прочие, 			
		|	СУММА(ЕСТЬNULL(ИтогиПоГлавам.ОснЗарплата / 1000,0) + ЕСТЬNULL(ИтогиПоГлавам.ЗарплМашин / 1000,0)) КАК ОплатаТруда,
		|		ЛОЖЬ КАК СтрокаОбработана
		|ИЗ
		|	РегистрСведений." + ТекРегистр + " КАК ИтогиПоГлавам
		|ГДЕ
		|	ИтогиПоГлавам.Смета = &Смета
		|СГРУППИРОВАТЬ ПО
		|	ИтогиПоГлавам.Смета,		
		|	ИтогиПоГлавам.Глава,
		|	ИтогиПоГлавам.Итог
		|УПОРЯДОЧИТЬ ПО
		|	ИтогиПоГлавам.Итог.ГлаваССРС.ПорядковыйНомер";	
	Иначе
		Запрос 			= Новый Запрос;
		Запрос.Текст 	= "
		|ВЫБРАТЬ
		|	ИтогиПоГлавам.Смета КАК ОбъектнаяСмета,
		|	ИтогиПоГлавам.Итог КАК Итог,
		|	ИтогиПоГлавам.Глава КАК Глава,
		|	СУММА(ЕСТЬNULL(
		|		ВЫБОР КОГДА ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы) ИЛИ
		|			        ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.МеталломонтажныеРаботы) ИЛИ 
		|		 			ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.БуровзрывныеРаботы) ИЛИ 
		|		  			ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.СантехническиеРаботы) ИЛИ 
		|		  			ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.ГорнопроходческиеРаботы) ТОГДА
		|					ИтогиПоГлавам.ТекПрямЗатраты / 1000 ИНАЧЕ 0 КОНЕЦ,0)) КАК СтроительныеРаботы, 	  
		|	СУММА(ЕСТЬNULL(
		|		ВЫБОР КОГДА ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.МонтажныеРаботы) ТОГДА 
		|		ИтогиПоГлавам.ТекПрямЗатраты / 1000 ИНАЧЕ 0 КОНЕЦ,0)) КАК МонтажныеРаботы, 	  
		|	СУММА(ЕСТЬNULL(
		|		ВЫБОР КОГДА ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.Оборудование) ТОГДА 
		|		ИтогиПоГлавам.ТекОборуд / 1000 ИНАЧЕ 0 КОНЕЦ,0)) КАК Оборудование,  
		|	СУММА(ЕСТЬNULL(
		|		ВЫБОР КОГДА ИтогиПоГлавам.ВидРабот = Значение(Перечисление.СМ_ВидыЗатратСмета.ПрочиеРаботы) ТОГДА 
		|		ИтогиПоГлавам.ТекПрямЗатраты / 1000 ИНАЧЕ 0 КОНЕЦ,0)) КАК Прочие, 			
		|	СУММА(ЕСТЬNULL(ИтогиПоГлавам.ТекОснЗарплата / 1000,0) + ЕСТЬNULL(ИтогиПоГлавам.ТекЗарплМашин / 1000,0)) КАК ОплатаТруда, 	
		|		ЛОЖЬ КАК СтрокаОбработана
		|ИЗ
		|	РегистрСведений." + ТекРегистр + " КАК ИтогиПоГлавам
		|ГДЕ
		|	ИтогиПоГлавам.Смета = &Смета
		|СГРУППИРОВАТЬ ПО
		|	ИтогиПоГлавам.Смета,		
		|	ИтогиПоГлавам.Глава,
		|	ИтогиПоГлавам.Итог
		|УПОРЯДОЧИТЬ ПО
		|	ИтогиПоГлавам.Итог.ГлаваССРС.ПорядковыйНомер";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Смета",Ссылка);
	ТабРезультат = Запрос.Выполнить().Выгрузить();

	ТабРезультат.Колонки.Добавить("СортировкаИтогов",Новый ОписаниеТипов("Число"));
	ТабРезультат.Колонки.Добавить("ЭтоСмета", Новый ОписаниеТипов("Булево"));
	ТабРезультат.Колонки.Добавить("Порядковыйномер");
	ТабРезультат.Колонки.Добавить("НомерИтогаКЧему");
	
	Для Каждого СтрокаИтога Из ТабРезультат Цикл
		Если ТипЗнч(СтрокаИтога.Итог) = Тип("СправочникСсылка.СМ_ЛимитированныеЗатраты") Тогда
			СтрокаИтога.СортировкаИтогов 	= СтрокаИтога.Глава.ПорядковыйНомер * 10000 + 2000 + СтрокаИтога.Итог.НомерПоПорядку;
			СтрокаИтога.НомерИтогаКЧему		= СтрокаИтога.Итог.КИтогу.ПорядковыйНомер;
			СтрокаИтога.Порядковыйномер		= СтрокаИтога.Итог.КИтогу.ПорядковыйНомер;
		ИначеЕсли ТипЗнч(СтрокаИтога.Итог) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") ИЛИ ТипЗнч(СтрокаИтога.Итог) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
			СтрокаИтога.СортировкаИтогов 	= СтрокаИтога.Глава.ПорядковыйНомер * 10000 + 1000 + СМ_СметаПечатьОбъектнаяСводнаяВызовСервера.НайтиНомерПоПорядкуСметы(Ссылка,СтрокаИтога.Итог);
			СтрокаИтога.ЭтоСмета			= Истина;
		ИначеЕсли ТипЗнч(СтрокаИтога.Итог) = Тип("СправочникСсылка.СМ_ИтогиПоГлавам") Тогда
			СтрокаИтога.СортировкаИтогов 	= СтрокаИтога.Глава.ПорядковыйНомер * 10000 + 3000 + СтрокаИтога.Итог.ПорядковыйНомер;
			СтрокаИтога.Порядковыйномер		= СтрокаИтога.Итог.ПорядковыйНомер;
		КонецЕсли;	
	КонецЦикла;	
	
	ТабРезультат.Сортировать("СортировкаИтогов");
	
	//СтрокаЛС.Параметры.НомерПП = НайтиНомерПоПорядкуСметы(Ссылка,СтрокаИтога.Итог);
	//СтрокаЛС.Параметры.НомерСметыДляПечати =  СтрокаИтога.Итог.НомерСметы;
	//ИтогПоГлаве = НайтиИтогПоГлаве(ПовторГлаваНеНакопительногоИтога,Ссылка.ТипСтроительства);

	Возврат ТабРезультат;
	
КонецФункции

Функция ПолучитьСписокРеквизитовСравнения()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("МонтажныеРаботы","МонтажныеРаботы1");
	Соответствие.Вставить("Оборудование","Оборудование1");
	Соответствие.Вставить("ОплатаТруда","ОплатаТруда1");
	Соответствие.Вставить("Прочие","Прочие1");
	Соответствие.Вставить("СтроительныеРаботы","СтроительныеРаботы1");
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьОбщуюТаблицуДанныхОС(ДеревоСмета1,ДеревоСмета2);

	ТабИтогов = Новый ТаблицаЗначений;
	ТабИтогов.Колонки.Добавить("Итог");
	ТабИтогов.Колонки.Добавить("Глава");
	ТабИтогов.Колонки.Добавить("ПорядковыйНомер");
	ТабИтогов.Колонки.Добавить("НомерИтогаКЧему");

	Для Каждого ТекСтрока Из ДеревоСмета1 Цикл
		//Если ТипЗнч(ТекСтрока.Итог) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") ИЛИ 
		//	 ТипЗнч(ТекСтрока.Итог) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		//	Продолжить;	
		//КонецЕсли;
		НоваяСтрока 					= ТабИтогов.Добавить();
		НоваяСтрока.Итог	            = ТекСтрока.Итог;
		НоваяСтрока.Глава	            = ТекСтрока.Глава;
		НоваяСтрока.ПорядковыйНомер	  	= ТекСтрока.ПорядковыйНомер;
		НоваяСтрока.НомерИтогаКЧему		= ТекСтрока.НомерИтогаКЧему;
	КонецЦикла;
	
	Для Каждого ТекСтрока Из ДеревоСмета2 Цикл
		//Если ТипЗнч(ТекСтрока.Итог) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") ИЛИ 
		//	 ТипЗнч(ТекСтрока.Итог) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		//	Продолжить;	
		//КонецЕсли;
		НоваяСтрока 					= ТабИтогов.Добавить();
		НоваяСтрока.Итог	            = ТекСтрока.Итог;
		НоваяСтрока.Глава	            = ТекСтрока.Глава;
		НоваяСтрока.ПорядковыйНомер	  	= ТекСтрока.ПорядковыйНомер;
		НоваяСтрока.НомерИтогаКЧему		= ТекСтрока.НомерИтогаКЧему;
	КонецЦикла;
	
	ТабИтогов.Свернуть("Итог,Глава,ПорядковыйНомер,НомерИтогаКЧему");
	ТабИтогов.Сортировать("ПорядковыйНомер,НомерИтогаКЧему Убыв");

	Возврат ТабИтогов;
	
КонецФункции

Функция ПолучитьОбщуюТаблицуДанныхСС(ДеревоСмета1,ДеревоСмета2);

	ТабИтогов = Новый ТаблицаЗначений;
	ТабИтогов.Колонки.Добавить("Итог");
	ТабИтогов.Колонки.Добавить("Глава");
	ТабИтогов.Колонки.Добавить("ПорядковыйНомер");
	ТабИтогов.Колонки.Добавить("НомерИтогаКЧему");

	ТабГлавы = Новый ТаблицаЗначений;
	ТабГлавы.Колонки.Добавить("Глава");
	ТабГлавы.Колонки.Добавить("Всего");

	Для Каждого ТекСтрока Из ДеревоСмета1 Цикл
		НоваяСтрокаГлавы				= ТабГлавы.Добавить();
		НоваяСтрокаГлавы.Глава			= ТекСтрока.Глава;
		НоваяСтрокаГлавы.Всего			= ТекСтрока.СтроительныеРаботы + ТекСтрока.МонтажныеРаботы + ТекСтрока.Оборудование + ТекСтрока.Прочие + ТекСтрока.ОплатаТруда;
										  
		НоваяСтрока 					= ТабИтогов.Добавить();
		НоваяСтрока.Итог	            = ТекСтрока.Итог;
		НоваяСтрока.Глава	            = ТекСтрока.Глава;
		НоваяСтрока.ПорядковыйНомер	  	= ТекСтрока.ПорядковыйНомер;
		НоваяСтрока.НомерИтогаКЧему		= ТекСтрока.НомерИтогаКЧему;
	КонецЦикла;
	
	Для Каждого ТекСтрока Из ДеревоСмета2 Цикл
		НоваяСтрокаГлавы				= ТабГлавы.Добавить();
		НоваяСтрокаГлавы.Глава			= ТекСтрока.Глава;
		НоваяСтрокаГлавы.Всего			= ТекСтрока.СтроительныеРаботы + ТекСтрока.МонтажныеРаботы + ТекСтрока.Оборудование + ТекСтрока.Прочие + ТекСтрока.ОплатаТруда;
										  
		НоваяСтрока 					= ТабИтогов.Добавить();
		НоваяСтрока.Итог	            = ТекСтрока.Итог;
		НоваяСтрока.Глава	            = ТекСтрока.Глава;
		НоваяСтрока.ПорядковыйНомер	  	= ТекСтрока.ПорядковыйНомер;
		НоваяСтрока.НомерИтогаКЧему		= ТекСтрока.НомерИтогаКЧему;
	КонецЦикла;
	
	ТабИтогов.Свернуть("Итог,Глава,ПорядковыйНомер,НомерИтогаКЧему");
	ТабИтогов.Сортировать("ПорядковыйНомер,НомерИтогаКЧему Убыв");
	
	ТабГлавы.Свернуть("Глава","Всего");
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТабИтогов",ТабИтогов);
	СтруктураВозврата.Вставить("ТабГлавы",ТабГлавы);
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#КонецОбласти
